evidence/erika3/pkg/arch/avr8/ee_atmega_intvect.c
/* ###*B*###
 * Erika Enterprise, version 3
 * 
 * Copyright (C) 2017 - 2018 Evidence s.r.l.
 * 
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or (at
 * your option) any later version.
 * 
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
 * General Public License, version 2, for more details.
 * 
 * You should have received a copy of the GNU General Public License,
 * version 2, along with this program; if not, see
 * < www.gnu.org/licenses/old-licenses/gpl-2.0.html >.
 * 
 * This program is distributed to you subject to the following
 * clarifications and special exceptions to the GNU General Public
 * License, version 2.
 * 
 * THIRD PARTIES' MATERIALS
 * 
 * Certain materials included in this library are provided by third
 * parties under licenses other than the GNU General Public License. You
 * may only use, copy, link to, modify and redistribute this library
 * following the terms of license indicated below for third parties'
 * materials.
 * 
 * In case you make modified versions of this library which still include
 * said third parties' materials, you are obligated to grant this special
 * exception.
 * 
 * The complete list of Third party materials allowed with ERIKA
 * Enterprise version 3, together with the terms and conditions of each
 * license, is present in the file THIRDPARTY.TXT in the root of the
 * project.
 * ###*E*### */

/** \file   ee_atmega_intvect.c
 *  \brief  Atmel ATMEGA MCUs Interrupts vector.
 *
 *  This files contains the implementation of Atmel ATMEGA MCUs Interrupts
 *  vector in Erika Enterprise.
 *
 *  \note   TO BE DOCUMENTED!!!
 *
 *  \author Giuseppe Serano
 *  \author Errico Guidieri
 *  \date   2016
 */

/* I need ISR2 Stub */
#include "ee_avr8_irqstub.h"

/* Erika Interrupt Vector Definition */

/* DUMMY interrupt vector */
OSEE_AVR8_ISR_NOT_DEFINED(BADISR_vect)

/* Interrupt Vector Table Recall. */
void osEE_atmega_intvect(void) {
  OSEE_AVR8_REQUEST_IRQ_ENTRY(BADISR_vect);
}

/* [GS]: TID Al posto dell'Handler */

#if (defined(OSEE_API_DYNAMIC))

/* INT0 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(INT0_vect, OSEE_AVR8_INT0_ISR_ID)

/* INT1 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(INT1_vect, OSEE_AVR8_INT1_ISR_ID)

#if (defined(__AVR_ATmega128__)) || (defined(__AVR_ATmega1281__))
/* INT2 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(INT2_vect, OSEE_AVR8_INT2_ISR_ID)

/* INT3 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(INT3_vect, OSEE_AVR8_INT3_ISR_ID)

/* INT4 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(INT4_vect, OSEE_AVR8_INT4_ISR_ID)

/* INT5 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(INT5_vect, OSEE_AVR8_INT5_ISR_ID)

/* INT6 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(INT6_vect, OSEE_AVR8_INT6_ISR_ID)

/* INT7 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(INT7_vect, OSEE_AVR8_INT7_ISR_ID)
#endif  /* __AVR_ATmega128__ || __AVR_ATmega1281__ */

#if                                 \
  (defined(__AVR_ATmega328__))  ||  \
  (defined(__AVR_ATmega328P__)) ||  \
  (defined(__AVR_ATmega1281__))
/* PCINT0 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(PCINT0_vect, OSEE_AVR8_PCINT0_ISR_ID)

/* PCINT1 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(PCINT1_vect, OSEE_AVR8_PCINT1_ISR_ID)

/* PCINT2 interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(PCINT2_vect, OSEE_AVR8_PCINT2_ISR_ID)

/* WDT interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(WDT_vect, OSEE_AVR8_WDT_ISR_ID)
#endif  /* __AVR_ATmega328__ || __AVR_ATmega328P__ || __AVR_ATmega1281__ */

#if (defined(__AVR_ATmega128__))
/* TIMER2_COMP interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER2_COMP_vect, OSEE_AVR8_TIMER2_COMP_ISR_ID)
#endif  /* __AVR_ATmega128__ */

#if                                 \
  (defined(__AVR_ATmega328__))  ||  \
  (defined(__AVR_ATmega328P__)) ||  \
  (defined(__AVR_ATmega1281__))
/* TIMER2_COMPA interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER2_COMPA_vect, OSEE_AVR8_TIMER2_COMPA_ISR_ID)

/* TIMER2_COMPB interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER2_COMPB_vect, OSEE_AVR8_TIMER2_COMPB_ISR_ID)
#endif  /* __AVR_ATmega328__ || __AVR_ATmega328P__ || __AVR_ATmega1281__ */

/* TIMER2_OVF interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER2_OVF_vect, OSEE_AVR8_TIMER2_OVF_ISR_ID)

/* TIMER1_CAPT interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER1_CAPT_vect, OSEE_AVR8_TIMER1_CAPT_ISR_ID)

/* TIMER1_COMPA interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER1_COMPA_vect, OSEE_AVR8_TIMER1_COMPA_ISR_ID)

/* TIMER1_COMPB interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER1_COMPB_vect, OSEE_AVR8_TIMER1_COMPB_ISR_ID)

#if (defined(__AVR_ATmega128__)) || (defined(__AVR_ATmega1281__))
/* TIMER1_COMPC interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER1_COMPC_vect, OSEE_AVR8_TIMER1_COMPC_ISR_ID)
#endif  /* __AVR_ATmega128__ || __AVR_ATmega1281__ */

/* TIMER1_OVF interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER1_OVF_vect, OSEE_AVR8_TIMER1_OVF_ISR_ID)

#if (defined(__AVR_ATmega128__))
/* TIMER0_COMP interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER0_COMP_vect, OSEE_AVR8_TIMER0_COMP_ISR_ID)
#endif  /* __AVR_ATmega128__ */

#if                                 \
  (defined(__AVR_ATmega328__))  ||  \
  (defined(__AVR_ATmega328P__)) ||  \
  (defined(__AVR_ATmega1281__))
/* TIMER2_COMPA interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER0_COMPA_vect, OSEE_AVR8_TIMER0_COMPA_ISR_ID)

/* TIMER0_COMPB interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER0_COMPB_vect, OSEE_AVR8_TIMER0_COMPB_ISR_ID)
#endif  /* __AVR_ATmega328__ || __AVR_ATmega328P__ || __AVR_ATmega1281__ */

#if (!defined(OS_EE_LIB_ARDUINO_SDK))
/* TIMER0_OVF interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER0_OVF_vect, OSEE_AVR8_TIMER0_OVF_ISR_ID)
#endif  /* !OS_EE_LIB_ARDUINO_SDK */

/* SPI_STC interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(SPI_STC_vect, OSEE_AVR8_SPI_STC_ISR_ID)

#if (defined(__AVR_ATmega128__)) || (defined(__AVR_ATmega1281__))
/* USART0_RX interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART0_RX_vect, OSEE_AVR8_USART0_RX_ISR_ID)

/* USART0_UDRE interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART0_UDRE_vect, OSEE_AVR8_USART0_UDRE_ISR_ID)

/* USART0_TX interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART0_TX_vect, OSEE_AVR8_USART0_TX_ISR_ID)
#endif  /* __AVR_ATmega128__ || __AVR_ATmega1281__ */

#if (defined (__AVR_ATmega328__)) || (defined(__AVR_ATmega328P__))
#if (!defined(OS_EE_LIB_ARDUINO_SDK))
/* USART_RX interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART_RX_vect, OSEE_AVR8_USART_RX_ISR_ID)

