evidence/erika3/pkg/arch/avr8/ee_atmega_intvect.c
/* USART_UDRE interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART_UDRE_vect, OSEE_AVR8_USART_UDRE_ISR_ID)

/* USART_TX interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART_TX_vect, OSEE_AVR8_USART_TX_ISR_ID)
#endif  /* !OSEE_LIB_ARDUINO_SDK */
#endif  /* __AVR_ATmega328__ || __AVR_ATmega328P__ */

/* ADC interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(ADC_vect, OSEE_AVR8_ADC_ISR_ID)

/* OSEE_READY interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(EE_READY_vect, OSEE_AVR8_EE_READY_ISR_ID)

/* ANALOG_COMP interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(ANALOG_COMP_vect, OSEE_AVR8_ANALOG_COMP_ISR_ID)

#if (defined(__AVR_ATmega128__)) || (defined(__AVR_ATmega1281__))
/* TIMER3_CAPT interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER3_CAPT_vect, OSEE_AVR8_TIMER3_CAPT_ISR_ID)

/* TIMER3_COMPA interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER3_COMPA_vect, OSEE_AVR8_TIMER3_COMPA_ISR_ID)

/* TIMER3_COMPB interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER3_COMPB_vect, OSEE_AVR8_TIMER3_COMPB_ISR_ID)

/* TIMER3_COMPC interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER3_COMPC_vect, OSEE_AVR8_TIMER3_COMPC_ISR_ID)

/* TIMER3_OVF interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER3_OVF_vect, OSEE_AVR8_TIMER3_OVF_ISR_ID)

/* USART1_RX interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART1_RX_vect, OSEE_AVR8_USART1_RX_ISR_ID)

/* USART1_UDRE interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART1_UDRE_vect, OSEE_AVR8_USART1_UDRE_ISR_ID)

/* USART1_TX interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART1_TX_vect, OSEE_AVR8_USART1_TX_ISR_ID)
#endif	/* __AVR_ATmega128__ || __AVR_ATmega1281__ */

/* TWI interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TWI_vect, OSEE_AVR8_TWI_ISR_ID)

/* SPM_READY interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(SPM_READY_vect, OSEE_AVR8_SPM_READY_ISR_ID)

#if (defined(__AVR_ATmega1281__))
/* TIMER4_CAPT interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER4_CAPT_vect, OSEE_AVR8_TIMER4_CAPT_ISR_ID)

/* TIMER4_COMPA interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER4_COMPA_vect, OSEE_AVR8_TIMER4_COMPA_ISR_ID)

/* TIMER4_COMPB interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER4_COMPB_vect, OSEE_AVR8_TIMER4_COMPB_ISR_ID)

/* TIMER4_COMPC interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER4_COMPC_vect, OSEE_AVR8_TIMER4_COMPC_ISR_ID)

/* TIMER4_OVF interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER4_OVF_vect, OSEE_AVR8_TIMER4_OVF_ISR_ID)

/* TIMER5_CAPT interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER5_CAPT_vect, OSEE_AVR8_TIMER5_CAPT_ISR_ID)

/* TIMER5_COMPA interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER5_COMPA_vect, OSEE_AVR8_TIMER5_COMPA_ISR_ID)

/* TIMER5_COMPB interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER5_COMPB_vect, OSEE_AVR8_TIMER5_COMPB_ISR_ID)

/* TIMER5_COMPC interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER5_COMPC_vect, OSEE_AVR8_TIMER5_COMPC_ISR_ID)

/* TIMER5_OVF interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(TIMER5_OVF_vect, OSEE_AVR8_TIMER5_OVF_ISR_ID)

/* USART2_RX interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART2_RX_vect, OSEE_AVR8_USART2_RX_ISR_ID)

/* USART2_UDRE interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART2_UDRE_vect, OSEE_AVR8_USART2_UDRE_ISR_ID)

/* USART2_TX interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART2_TX_vect, OSEE_AVR8_USART2_TX_ISR_ID)

/* USART3_RX interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART3_RX_vect, OSEE_AVR8_USART3_RX_ISR_ID)

/* USART3_UDRE interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART3_UDRE_vect, OSEE_AVR8_USART3_UDRE_ISR_ID)

/* USART3_TX interrupt vector */
OSEE_AVR8_ISR2_DEFINITION(USART3_TX_vect, OSEE_AVR8_USART3_TX_ISR_ID)
#endif  /* __AVR_ATmega1281__ */

#else  /* OSEE_API_DYNAMIC */

/* INT0 interrupt vector */
#if (defined(OSEE_AVR8_INT0_ISR_TID)) && (OSEE_AVR8_INT0_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(INT0_vect, OSEE_AVR8_INT0_ISR_TID)
#elif (defined(OSEE_AVR8_INT0_ISR)) && (OSEE_AVR8_INT0_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(INT0_vect, OSEE_AVR8_INT0_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(INT0_vect)
#endif /* OSEE_AVR8_INT0_ISR */

/* INT1 interrupt vector */
#if (defined(OSEE_AVR8_INT1_ISR_TID)) && (OSEE_AVR8_INT1_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(INT1_vect, OSEE_AVR8_INT1_ISR_TID)
#elif (defined(OSEE_AVR8_INT1_ISR)) && (OSEE_AVR8_INT1_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(INT1_vect, OSEE_AVR8_INT1_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(INT1_vect)
#endif /* OSEE_AVR8_INT1_ISR */

#if (defined(__AVR_ATmega128__)) || (defined(__AVR_ATmega1281__))
/* INT2 interrupt vector */
#if (defined(OSEE_AVR8_INT2_ISR_TID)) && (OSEE_AVR8_INT2_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(INT2_vect, OSEE_AVR8_INT2_ISR_TID)
#elif (defined(OSEE_AVR8_INT2_ISR)) && (OSEE_AVR8_INT2_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(INT2_vect, OSEE_AVR8_INT2_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(INT2_vect)
#endif /* OSEE_AVR8_INT2_ISR */

/* INT3 interrupt vector */
#if (defined(OSEE_AVR8_INT3_ISR_TID)) && (OSEE_AVR8_INT3_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(INT3_vect, OSEE_AVR8_INT3_ISR_TID)
#elif (defined(OSEE_AVR8_INT3_ISR)) && (OSEE_AVR8_INT3_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(INT3_vect, OSEE_AVR8_INT3_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(INT3_vect)
#endif /* OSEE_AVR8_INT3_ISR */

/* INT4 interrupt vector */
#if (defined(OSEE_AVR8_INT4_ISR_TID)) && (OSEE_AVR8_INT4_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(INT4_vect, OSEE_AVR8_INT4_ISR_TID)
#elif (defined(OSEE_AVR8_INT4_ISR)) && (OSEE_AVR8_INT4_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(INT4_vect, OSEE_AVR8_INT4_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(INT4_vect)
#endif /* OSEE_AVR8_INT4_ISR */

/* INT5 interrupt vector */
#if (defined(OSEE_AVR8_INT5_ISR_TID)) && (OSEE_AVR8_INT5_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(INT5_vect, OSEE_AVR8_INT5_ISR_TID)
#elif (defined(OSEE_AVR8_INT5_ISR)) && (OSEE_AVR8_INT5_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(INT5_vect, OSEE_AVR8_INT5_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(INT5_vect)
#endif /* OSEE_AVR8_INT5_ISR */

/* INT6 interrupt vector */
#if (defined(OSEE_AVR8_INT6_ISR_TID)) && (OSEE_AVR8_INT6_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(INT6_vect, OSEE_AVR8_INT6_ISR_TID)
#elif (defined(OSEE_AVR8_INT6_ISR)) && (OSEE_AVR8_INT6_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(INT6_vect, OSEE_AVR8_INT6_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(INT6_vect)
#endif /* OSEE_AVR8_INT6_ISR */

/* INT7 interrupt vector */
#if (defined(OSEE_AVR8_INT7_ISR_TID)) && (OSEE_AVR8_INT7_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(INT7_vect, OSEE_AVR8_INT7_ISR_TID)
#elif (defined(OSEE_AVR8_INT7_ISR)) && (OSEE_AVR8_INT7_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(INT7_vect, OSEE_AVR8_INT7_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(INT7_vect)
#endif  /* OSEE_AVR8_INT7_ISR */
#endif  /* __AVR_ATmega128__ || __AVR_ATmega1281__ */

#if                                 \
  (defined(__AVR_ATmega328__))  ||  \
  (defined(__AVR_ATmega328P__)) ||  \
  (defined(__AVR_ATmega1281__))

/* PCINT0 interrupt vector */
#if (defined(OSEE_AVR8_PCINT0_ISR_TID)) && (OSEE_AVR8_PCINT0_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(PCINT0_vect, OSEE_AVR8_PCINT0_ISR_TID)
#elif (defined(OSEE_AVR8_PCINT0_ISR)) && (OSEE_AVR8_PCINT0_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(PCINT0_vect, OSEE_AVR8_PCINT0_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(PCINT0_vect)
#endif /* OSEE_AVR8_PCINT0_ISR */

/* PCINT1 interrupt vector */
#if (defined(OSEE_AVR8_PCINT1_ISR_TID)) && (OSEE_AVR8_PCINT1_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(PCINT1_vect, OSEE_AVR8_PCINT1_ISR_TID)
#elif (defined(OSEE_AVR8_PCINT1_ISR)) && (OSEE_AVR8_PCINT1_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(PCINT1_vect, OSEE_AVR8_PCINT1_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(PCINT1_vect)
#endif /* OSEE_AVR8_PCINT1_ISR */

