evidence/erika3/pkg/arch/avr8/ee_atmega_intvect.c
/* PCINT2 interrupt vector */
#if (defined(OSEE_AVR8_PCINT2_ISR_TID)) && (OSEE_AVR8_PCINT2_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(PCINT2_vect, OSEE_AVR8_PCINT2_ISR_TID)
#elif (defined(OSEE_AVR8_PCINT2_ISR)) && (OSEE_AVR8_PCINT2_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(PCINT2_vect, OSEE_AVR8_PCINT2_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(PCINT2_vect)
#endif /* OSEE_AVR8_PCINT2_ISR */

/* WDT interrupt vector */
#if (defined(OSEE_AVR8_WDT_ISR_TID)) && (OSEE_AVR8_WDT_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(WDT_vect, OSEE_AVR8_WDT_ISR_TID)
#elif (defined(OSEE_AVR8_WDT_ISR)) && (OSEE_AVR8_WDT_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(WDT_vect, OSEE_AVR8_WDT_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(WDT_vect)
#endif /* OSEE_AVR8_WDT_ISR */
#endif /* __AVR_ATmega328__ || __AVR_ATmega328P__ || __AVR_ATmega1281__ */

#if (defined(__AVR_ATmega128__))
/* TIMER2_COMP interrupt vector */
#if (defined(OSEE_AVR8_TIMER2_COMP_ISR_TID)) && (OSEE_AVR8_TIMER2_COMP_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER2_COMP_vect, OSEE_AVR8_TIMER2_COMP_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER2_COMP_ISR)) && (OSEE_AVR8_TIMER2_COMP_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER2_COMP_vect, OSEE_AVR8_TIMER2_COMP_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER2_COMP_vect)
#endif /* OSEE_AVR8_TIMER2_COMP_ISR */
#endif /* __AVR_ATmega128__ */

#if                                 \
  (defined(__AVR_ATmega328__))  ||  \
  (defined(__AVR_ATmega328P__)) ||  \
  (defined(__AVR_ATmega1281__))

/* TIMER2_COMPA interrupt vector */
#if (defined(OSEE_AVR8_TIMER2_COMPA_ISR_TID)) && (OSEE_AVR8_TIMER2_COMPA_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER2_COMPA_vect, OSEE_AVR8_TIMER2_COMPA_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER2_COMPA_ISR)) && (OSEE_AVR8_TIMER2_COMPA_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER2_COMPA_vect, OSEE_AVR8_TIMER2_COMPA_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER2_COMPA_vect)
#endif /* OSEE_AVR8_TIMER2_COMPA_ISR */

/* TIMER2_COMPB interrupt vector */
#if (defined(OSEE_AVR8_TIMER2_COMPB_ISR_TID)) && (OSEE_AVR8_TIMER2_COMPB_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER2_COMPB_vect, OSEE_AVR8_TIMER2_COMPB_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER2_COMPB_ISR)) && (OSEE_AVR8_TIMER2_COMPB_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER2_COMPB_vect, OSEE_AVR8_TIMER2_COMPB_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER2_COMPB_vect)
#endif /* OSEE_AVR8_TIMER2_COMPB_ISR */
#endif /* __AVR_ATmega328__ || __AVR_ATmega328P__ || __AVR_ATmega1281__ */

/* TIMER2_OVF interrupt vector */
#if (defined(OSEE_AVR8_TIMER2_OVF_ISR_TID)) && (OSEE_AVR8_TIMER2_OVF_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER2_OVF_vect, OSEE_AVR8_TIMER2_OVF_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER2_OVF_ISR)) && (OSEE_AVR8_TIMER2_OVF_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER2_OVF_vect, OSEE_AVR8_TIMER2_OVF_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER2_OVF_vect)
#endif /* OSEE_AVR8_TIMER2_OVF_ISR */

/* TIMER1_CAPT interrupt vector */
#if (defined(OSEE_AVR8_TIMER1_CAPT_ISR_TID)) && (OSEE_AVR8_TIMER1_CAPT_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER1_CAPT_vect, OSEE_AVR8_TIMER1_CAPT_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER1_CAPT_ISR)) && (OSEE_AVR8_TIMER1_CAPT_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER1_CAPT_vect, OSEE_AVR8_TIMER1_CAPT_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER1_CAPT_vect)
#endif /* OSEE_AVR8_TIMER1_CAPT_ISR */

/* TIMER1_COMPA interrupt vector */
#if (defined(OSEE_AVR8_TIMER1_COMPA_ISR_TID)) && (OSEE_AVR8_TIMER1_COMPA_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER1_COMPA_vect, OSEE_AVR8_TIMER1_COMPA_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER1_COMPA_ISR)) && (OSEE_AVR8_TIMER1_COMPA_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER1_COMPA_vect, OSEE_AVR8_TIMER1_COMPA_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER1_COMPA_vect)
#endif /* OSEE_AVR8_TIMER1_COMPA_ISR */

/* TIMER1_COMPB interrupt vector */
#if (defined(OSEE_AVR8_TIMER1_COMPB_ISR_TID)) && (OSEE_AVR8_TIMER1_COMPB_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER1_COMPB_vect, OSEE_AVR8_TIMER1_COMPB_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER1_COMPB_ISR)) && (OSEE_AVR8_TIMER1_COMPB_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER1_COMPB_vect, OSEE_AVR8_TIMER1_COMPB_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER1_COMPB_vect)
#endif /* OSEE_AVR8_TIMER1_COMPB_ISR */

#if (defined(__AVR_ATmega128__)) || (defined(__AVR_ATmega1281__))
/* TIMER1_COMPC interrupt vector */
#if (defined(OSEE_AVR8_TIMER1_COMPC_ISR_TID)) && (OSEE_AVR8_TIMER1_COMPC_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER1_COMPC_vect, OSEE_AVR8_TIMER1_COMPC_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER1_COMPC_ISR)) && (OSEE_AVR8_TIMER1_COMPC_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER1_COMPC_vect, OSEE_AVR8_TIMER1_COMPC_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER1_COMPC_vect)
#endif /* OSEE_AVR8_TIMER1_COMPC_ISR */
#endif /* __AVR_ATmega128__ || __AVR_ATmega1281__ */

/* TIMER1_OVF interrupt vector */
#if (defined(OSEE_AVR8_TIMER1_OVF_ISR_TID)) && (OSEE_AVR8_TIMER1_OVF_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER1_OVF_vect, OSEE_AVR8_TIMER1_OVF_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER1_OVF_ISR)) && (OSEE_AVR8_TIMER1_OVF_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER1_OVF_vect, OSEE_AVR8_TIMER1_OVF_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER1_OVF_vect)
#endif /* OSEE_AVR8_TIMER1_OVF_ISR */

#if (defined(__AVR_ATmega128__))
/* TIMER0_COMP interrupt vector */
#if (defined(OSEE_AVR8_TIMER0_COMP_ISR_TID)) && (OSEE_AVR8_TIMER0_COMP_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER0_COMP_vect, OSEE_AVR8_TIMER0_COMP_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER0_COMP_ISR)) && (OSEE_AVR8_TIMER0_COMP_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER0_COMP_vect, OSEE_AVR8_TIMER0_COMP_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER0_COMP_vect)
#endif /* OSEE_AVR8_TIMER0_COMP_ISR */
#endif /* __AVR_ATmega128__ */

#if                                 \
  (defined(__AVR_ATmega328__))  ||  \
  (defined(__AVR_ATmega328P__)) ||  \
  (defined(__AVR_ATmega1281__))

/* TIMER2_COMPA interrupt vector */
#if (defined(OSEE_AVR8_TIMER0_COMPA_ISR_TID)) && (OSEE_AVR8_TIMER0_COMPA_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER0_COMPA_vect, OSEE_AVR8_TIMER0_COMPA_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER0_COMPA_ISR)) && (OSEE_AVR8_TIMER0_COMPA_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER0_COMPA_vect, OSEE_AVR8_TIMER0_COMPA_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER0_COMPA_vect)
#endif /* OSEE_AVR8_TIMER0_COMPA_ISR */

/* TIMER0_COMPB interrupt vector */
#if (defined(OSEE_AVR8_TIMER0_COMPB_ISR_TID)) && (OSEE_AVR8_TIMER0_COMPB_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER0_COMPB_vect, OSEE_AVR8_TIMER0_COMPB_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER0_COMPB_ISR)) && (OSEE_AVR8_TIMER0_COMPB_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER0_COMPB_vect, OSEE_AVR8_TIMER0_COMPB_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER0_COMPB_vect)
#endif /* OSEE_AVR8_TIMER0_COMPB_ISR */
#endif /* __AVR_ATmega328__ || __AVR_ATmega328P__ || __AVR_ATmega1281__ */

/* TIMER0_OVF interrupt vector */
#if (defined(OSEE_AVR8_TIMER0_OVF_ISR_TID)) && (OSEE_AVR8_TIMER0_OVF_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER0_OVF_vect, OSEE_AVR8_TIMER0_OVF_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER0_OVF_ISR)) && (OSEE_AVR8_TIMER0_OVF_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER0_OVF_vect, OSEE_AVR8_TIMER0_OVF_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER0_OVF_vect)
#endif /* OSEE_AVR8_TIMER0_OVF_ISR */

/* SPI_STC interrupt vector */
#if (defined(OSEE_AVR8_SPI_STC_ISR_TID)) && (OSEE_AVR8_SPI_STC_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(SPI_STC_vect, OSEE_AVR8_SPI_STC_ISR_TID)
#elif (defined(OSEE_AVR8_SPI_STC_ISR)) && (OSEE_AVR8_SPI_STC_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(SPI_STC_vect, OSEE_AVR8_SPI_STC_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(SPI_STC_vect)
#endif /* OSEE_AVR8_SPI_STC_ISR */

#if (defined(__AVR_ATmega128__)) || (defined(__AVR_ATmega1281__))
/* USART0_RX interrupt vector */
#if (defined(OSEE_AVR8_USART0_RX_ISR_TID)) && (OSEE_AVR8_USART0_RX_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART0_RX_vect, OSEE_AVR8_USART0_RX_ISR_TID)
#elif (defined(OSEE_AVR8_USART0_RX_ISR)) && (OSEE_AVR8_USART0_RX_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART0_RX_vect, OSEE_AVR8_USART0_RX_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART0_RX_vect)
#endif /* OSEE_AVR8_USART0_RX_ISR */

/* USART0_UDRE interrupt vector */
#if (defined(OSEE_AVR8_USART0_UDRE_ISR_TID)) && (OSEE_AVR8_USART0_UDRE_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART0_UDRE_vect, OSEE_AVR8_USART0_UDRE_ISR_TID)
#elif (defined(OSEE_AVR8_USART0_UDRE_ISR)) && (OSEE_AVR8_USART0_UDRE_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART0_UDRE_vect, OSEE_AVR8_USART0_UDRE_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART0_UDRE_vect)
#endif /* OSEE_AVR8_USART0_UDRE_ISR */

/* USART0_TX interrupt vector */
#if (defined(OSEE_AVR8_USART0_TX_ISR_TID)) && (OSEE_AVR8_USART0_TX_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART0_TX_vect, OSEE_AVR8_USART0_TX_ISR_TID)
#elif (defined(OSEE_AVR8_USART0_TX_ISR)) && (OSEE_AVR8_USART0_TX_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART0_TX_vect, OSEE_AVR8_USART0_TX_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART0_TX_vect)
#endif /* OSEE_AVR8_USART0_TX_ISR */
#endif /* __AVR_ATmega128__ || __AVR_ATmega1281__ */

#if (defined(__AVR_ATmega328__)) || (defined(__AVR_ATmega328P__))
/* USART_RX interrupt vector */
#if (defined(OSEE_AVR8_USART_RX_ISR_TID)) && (OSEE_AVR8_USART_RX_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART_RX_vect, OSEE_AVR8_USART_RX_ISR_TID)
#elif (defined(OSEE_AVR8_USART_RX_ISR)) && (OSEE_AVR8_USART_RX_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART_RX_vect, OSEE_AVR8_USART_RX_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART_RX_vect)
#endif /* OSEE_AVR8_USART_RX_ISR */

