evidence/erika3/pkg/arch/avr8/ee_atmega_intvect.c
/* USART_UDRE interrupt vector */
#if (defined(OSEE_AVR8_USART_UDRE_ISR_TID)) && (OSEE_AVR8_USART_UDRE_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART_UDRE_vect, OSEE_AVR8_USART_UDRE_ISR_TID)
#elif (defined(OSEE_AVR8_USART_UDRE_ISR)) && (OSEE_AVR8_USART_UDRE_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART_UDRE_vect, OSEE_AVR8_USART_UDRE_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART_UDRE_vect)
#endif /* OSEE_AVR8_USART_UDRE_ISR */

/* USART_TX interrupt vector */
#if (defined(OSEE_AVR8_USART_TX_ISR_TID)) && (OSEE_AVR8_USART_TX_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART_TX_vect, OSEE_AVR8_USART_TX_ISR_TID)
#elif (defined(OSEE_AVR8_USART_TX_ISR)) && (OSEE_AVR8_USART_TX_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART_TX_vect, OSEE_AVR8_USART_TX_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART_TX_vect)
#endif /* OSEE_AVR8_USART_TX_ISR */
#endif /* __AVR_ATmega328__ || __AVR_ATmega328P__ */

/* ADC interrupt vector */
#if (defined(OSEE_AVR8_ADC_ISR_TID)) && (OSEE_AVR8_ADC_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(ADC_vect, OSEE_AVR8_ADC_ISR_TID)
#elif (defined(OSEE_AVR8_ADC_ISR)) && (OSEE_AVR8_ADC_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(ADC_vect, OSEE_AVR8_ADC_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(ADC_vect)
#endif /* OSEE_AVR8_ADC_ISR */

/* EE_READY interrupt vector */
#if (defined(OSEE_AVR8_EE_READY_ISR_TID)) && (OSEE_AVR8_EE_READY_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(EE_READY_vect, OSEE_AVR8_EE_READY_ISR_TID)
#elif (defined(OSEE_AVR8_EE_READY_ISR)) && (OSEE_AVR8_EE_READY_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(EE_READY_vect, OSEE_AVR8_EE_READY_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(EE_READY_vect)
#endif /* OSEE_AVR8_EE_READY_ISR */

/* ANALOG_COMP interrupt vector */
#if (defined(OSEE_AVR8_ANALOG_COMP_ISR_TID)) && (OSEE_AVR8_ANALOG_COMP_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(ANALOG_COMP_vect, OSEE_AVR8_ANALOG_COMP_ISR_TID)
#elif (defined(OSEE_AVR8_ANALOG_COMP_ISR)) && (OSEE_AVR8_ANALOG_COMP_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(ANALOG_COMP_vect, OSEE_AVR8_ANALOG_COMP_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(ANALOG_COMP_vect)
#endif /* OSEE_AVR8_ANALOG_COMP_ISR */

#if (defined(__AVR_ATmega128__)) || (defined(__AVR_ATmega1281__))
/* TIMER3_CAPT interrupt vector */
#if (defined(OSEE_AVR8_TIMER3_CAPT_ISR_TID)) && (OSEE_AVR8_TIMER3_CAPT_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER3_CAPT_vect, OSEE_AVR8_TIMER3_CAPT_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER3_CAPT_ISR)) && (OSEE_AVR8_TIMER3_CAPT_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER3_CAPT_vect, OSEE_AVR8_TIMER3_CAPT_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER3_CAPT_vect)
#endif /* OSEE_AVR8_TIMER3_CAPT_ISR */

/* TIMER3_COMPA interrupt vector */
#if (defined(OSEE_AVR8_TIMER3_COMPA_ISR_TID)) && (OSEE_AVR8_TIMER3_COMPA_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER3_COMPA_vect, OSEE_AVR8_TIMER3_COMPA_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER3_COMPA_ISR)) && (OSEE_AVR8_TIMER3_COMPA_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER3_COMPA_vect, OSEE_AVR8_TIMER3_COMPA_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER3_COMPA_vect)
#endif /* OSEE_AVR8_TIMER3_COMPA_ISR */

/* TIMER3_COMPB interrupt vector */
#if (defined(OSEE_AVR8_TIMER3_COMPB_ISR_TID)) && (OSEE_AVR8_TIMER3_COMPB_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER3_COMPB_vect, OSEE_AVR8_TIMER3_COMPB_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER3_COMPB_ISR)) && (OSEE_AVR8_TIMER3_COMPB_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER3_COMPB_vect, OSEE_AVR8_TIMER3_COMPB_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER3_COMPB_vect)
#endif /* OSEE_AVR8_TIMER3_COMPB_ISR */

/* TIMER3_COMPC interrupt vector */
#if (defined(OSEE_AVR8_TIMER3_COMPC_ISR_TID)) && (OSEE_AVR8_TIMER3_COMPC_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER3_COMPC_vect, OSEE_AVR8_TIMER3_COMPC_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER3_COMPC_ISR)) && (OSEE_AVR8_TIMER3_COMPC_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER3_COMPC_vect, OSEE_AVR8_TIMER3_COMPC_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER3_COMPC_vect)
#endif /* OSEE_AVR8_TIMER3_COMPC_ISR */

/* TIMER3_OVF interrupt vector */
#if (defined(OSEE_AVR8_TIMER3_OVF_ISR_TID)) && (OSEE_AVR8_TIMER3_OVF_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER3_OVF_vect, OSEE_AVR8_TIMER3_OVF_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER3_OVF_ISR)) && (OSEE_AVR8_TIMER3_OVF_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER3_OVF_vect, OSEE_AVR8_TIMER3_OVF_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER3_OVF_vect)
#endif /* OSEE_AVR8_TIMER3_OVF_ISR */

/* USART1_RX interrupt vector */
#if (defined(OSEE_AVR8_USART1_RX_ISR_TID)) && (OSEE_AVR8_USART1_RX_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART1_RX_vect, OSEE_AVR8_USART1_RX_ISR_TID)
#elif (defined(OSEE_AVR8_USART1_RX_ISR)) && (OSEE_AVR8_USART1_RX_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART1_RX_vect, OSEE_AVR8_USART1_RX_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART1_RX_vect)
#endif /* OSEE_AVR8_USART1_RX_ISR */

/* USART1_UDRE interrupt vector */
#if (defined(OSEE_AVR8_USART1_UDRE_ISR_TID)) && (OSEE_AVR8_USART1_UDRE_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART1_UDRE_vect, OSEE_AVR8_USART1_UDRE_ISR_TID)
#elif (defined(OSEE_AVR8_USART1_UDRE_ISR)) && (OSEE_AVR8_USART1_UDRE_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART1_UDRE_vect, OSEE_AVR8_USART1_UDRE_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART1_UDRE_vect)
#endif /* OSEE_AVR8_USART1_UDRE_ISR */

/* USART1_TX interrupt vector */
#if (defined(OSEE_AVR8_USART1_TX_ISR_TID)) && (OSEE_AVR8_USART1_TX_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART1_TX_vect, OSEE_AVR8_USART1_TX_ISR_TID)
#elif (defined(OSEE_AVR8_USART1_TX_ISR)) && (OSEE_AVR8_USART1_TX_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART1_TX_vect, OSEE_AVR8_USART1_TX_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART1_TX_vect)
#endif /* OSEE_AVR8_USART1_TX_ISR */
#endif /* __AVR_ATmega128__ || __AVR_ATmega1281__ */

/* TWI interrupt vector */
#if (defined(OSEE_AVR8_TWI_ISR_TID)) && (OSEE_AVR8_TWI_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TWI_vect, OSEE_AVR8_TWI_ISR_TID)
#elif (defined(OSEE_AVR8_TWI_ISR)) && (OSEE_AVR8_TWI_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TWI_vect, OSEE_AVR8_TWI_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TWI_vect)
#endif /* OSEE_AVR8_TWI_ISR */

