evidence/erika3/pkg/arch/avr8/ee_atmega_intvect.c
/* SPM_READY interrupt vector */
#if (defined(OSEE_AVR8_SPM_READY_ISR_TID)) && (OSEE_AVR8_SPM_READY_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(SPM_READY_vect, OSEE_AVR8_SPM_READY_ISR_TID)
#elif (defined(OSEE_AVR8_SPM_READY_ISR)) && (OSEE_AVR8_SPM_READY_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(SPM_READY_vect, OSEE_AVR8_SPM_READY_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(SPM_READY_vect)
#endif /* OSEE_AVR8_SPM_READY_ISR */

#if (defined(__AVR_ATmega1281__))
/* TIMER4_CAPT interrupt vector */
#if (defined(OSEE_AVR8_TIMER4_CAPT_ISR_TID)) && (OSEE_AVR8_TIMER4_CAPT_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER4_CAPT_vect, OSEE_AVR8_TIMER4_CAPT_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER4_CAPT_ISR)) && (OSEE_AVR8_TIMER4_CAPT_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER4_CAPT_vect, OSEE_AVR8_TIMER4_CAPT_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER4_CAPT_vect)
#endif /* OSEE_AVR8_TIMER4_CAPT_ISR */

/* TIMER4_COMPA interrupt vector */
#if (defined(OSEE_AVR8_TIMER4_COMPA_ISR_TID)) && (OSEE_AVR8_TIMER4_COMPA_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER4_COMPA_vect, OSEE_AVR8_TIMER4_COMPA_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER4_COMPA_ISR)) && (OSEE_AVR8_TIMER4_COMPA_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER4_COMPA_vect, OSEE_AVR8_TIMER4_COMPA_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER4_COMPA_vect)
#endif /* OSEE_AVR8_TIMER4_COMPA_ISR */

/* TIMER4_COMPB interrupt vector */
#if (defined(OSEE_AVR8_TIMER4_COMPB_ISR_TID)) && (OSEE_AVR8_TIMER4_COMPB_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER4_COMPB_vect, OSEE_AVR8_TIMER4_COMPB_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER4_COMPB_ISR)) && (OSEE_AVR8_TIMER4_COMPB_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER4_COMPB_vect, OSEE_AVR8_TIMER4_COMPB_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER4_COMPB_vect)
#endif /* OSEE_AVR8_TIMER4_COMPB_ISR */

/* TIMER4_COMPC interrupt vector */
#if (defined(OSEE_AVR8_TIMER4_COMPC_ISR_TID)) && (OSEE_AVR8_TIMER4_COMPC_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER4_COMPC_vect, OSEE_AVR8_TIMER4_COMPC_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER4_COMPC_ISR)) && (OSEE_AVR8_TIMER4_COMPC_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER4_COMPC_vect, OSEE_AVR8_TIMER4_COMPC_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER4_COMPC_vect)
#endif /* OSEE_AVR8_TIMER4_COMPC_ISR */

/* TIMER4_OVF interrupt vector */
#if (defined(OSEE_AVR8_TIMER4_OVF_ISR_TID)) && (OSEE_AVR8_TIMER4_OVF_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER4_OVF_vect, OSEE_AVR8_TIMER4_OVF_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER4_OVF_ISR)) && (OSEE_AVR8_TIMER4_OVF_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER4_OVF_vect, OSEE_AVR8_TIMER4_OVF_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER4_OVF_vect)
#endif /* OSEE_AVR8_TIMER4_OVF_ISR */

/* TIMER5_CAPT interrupt vector */
#if (defined(OSEE_AVR8_TIMER5_CAPT_ISR_TID)) && (OSEE_AVR8_TIMER5_CAPT_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER5_CAPT_vect, OSEE_AVR8_TIMER5_CAPT_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER5_CAPT_ISR)) && (OSEE_AVR8_TIMER5_CAPT_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER5_CAPT_vect, OSEE_AVR8_TIMER5_CAPT_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER5_CAPT_vect)
#endif /* OSEE_AVR8_TIMER5_CAPT_ISR */

/* TIMER5_COMPA interrupt vector */
#if (defined(OSEE_AVR8_TIMER5_COMPA_ISR_TID)) && (OSEE_AVR8_TIMER5_COMPA_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER5_COMPA_vect, OSEE_AVR8_TIMER5_COMPA_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER5_COMPA_ISR)) && (OSEE_AVR8_TIMER5_COMPA_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER5_COMPA_vect, OSEE_AVR8_TIMER5_COMPA_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER5_COMPA_vect)
#endif /* OSEE_AVR8_TIMER5_COMPA_ISR */

/* TIMER5_COMPB interrupt vector */
#if (defined(OSEE_AVR8_TIMER5_COMPB_ISR_TID)) && (OSEE_AVR8_TIMER5_COMPB_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER5_COMPB_vect, OSEE_AVR8_TIMER5_COMPB_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER5_COMPB_ISR)) && (OSEE_AVR8_TIMER5_COMPB_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER5_COMPB_vect, OSEE_AVR8_TIMER5_COMPB_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER5_COMPB_vect)
#endif /* OSEE_AVR8_TIMER5_COMPB_ISR */

/* TIMER5_COMPC interrupt vector */
#if (defined(OSEE_AVR8_TIMER5_COMPC_ISR_TID)) && (OSEE_AVR8_TIMER5_COMPC_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER5_COMPC_vect, OSEE_AVR8_TIMER5_COMPC_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER5_COMPC_ISR)) && (OSEE_AVR8_TIMER5_COMPC_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER5_COMPC_vect, OSEE_AVR8_TIMER5_COMPC_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER5_COMPC_vect)
#endif /* OSEE_AVR8_TIMER5_COMPC_ISR */

/* TIMER5_OVF interrupt vector */
#if (defined(OSEE_AVR8_TIMER5_OVF_ISR_TID)) && (OSEE_AVR8_TIMER5_OVF_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(TIMER5_OVF_vect, OSEE_AVR8_TIMER5_OVF_ISR_TID)
#elif (defined(OSEE_AVR8_TIMER5_OVF_ISR)) && (OSEE_AVR8_TIMER5_OVF_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(TIMER5_OVF_vect, OSEE_AVR8_TIMER5_OVF_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(TIMER5_OVF_vect)
#endif /* OSEE_AVR8_TIMER5_OVF_ISR */

/* USART2_RX interrupt vector */
#if (defined(OSEE_AVR8_USART2_RX_ISR_TID)) && (OSEE_AVR8_USART2_RX_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART2_RX_vect, OSEE_AVR8_USART2_RX_ISR_TID)
#elif (defined(OSEE_AVR8_USART2_RX_ISR)) && (OSEE_AVR8_USART2_RX_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART2_RX_vect, OSEE_AVR8_USART2_RX_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART2_RX_vect)
#endif /* OSEE_AVR8_USART2_RX_ISR */

/* USART2_UDRE interrupt vector */
#if (defined(OSEE_AVR8_USART2_UDRE_ISR_TID)) && (OSEE_AVR8_USART2_UDRE_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART2_UDRE_vect, OSEE_AVR8_USART2_UDRE_ISR_TID)
#elif (defined(OSEE_AVR8_USART2_UDRE_ISR)) && (OSEE_AVR8_USART2_UDRE_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART2_UDRE_vect, OSEE_AVR8_USART2_UDRE_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART2_UDRE_vect)
#endif /* OSEE_AVR8_USART2_UDRE_ISR */

