evidence/erika3/pkg/arch/avr8/ee_atmega_intvect.c
/* USART2_TX interrupt vector */
#if (defined(OSEE_AVR8_USART2_TX_ISR_TID)) && (OSEE_AVR8_USART2_TX_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART2_TX_vect, OSEE_AVR8_USART2_TX_ISR_TID)
#elif (defined(OSEE_AVR8_USART2_TX_ISR)) && (OSEE_AVR8_USART2_TX_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART2_TX_vect, OSEE_AVR8_USART2_TX_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART2_TX_vect)
#endif /* OSEE_AVR8_USART2_TX_ISR */

/* USART3_RX interrupt vector */
#if (defined(OSEE_AVR8_USART3_RX_ISR_TID)) && (OSEE_AVR8_USART3_RX_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART3_RX_vect, OSEE_AVR8_USART3_RX_ISR_TID)
#elif (defined(OSEE_AVR8_USART3_RX_ISR)) && (OSEE_AVR8_USART3_RX_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART3_RX_vect, OSEE_AVR8_USART3_RX_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART3_RX_vect)
#endif /* OSEE_AVR8_USART3_RX_ISR */

/* USART3_UDRE interrupt vector */
#if (defined(OSEE_AVR8_USART3_UDRE_ISR_TID)) && (OSEE_AVR8_USART3_UDRE_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART3_UDRE_vect, OSEE_AVR8_USART3_UDRE_ISR_TID)
#elif (defined(OSEE_AVR8_USART3_UDRE_ISR)) && (OSEE_AVR8_USART3_UDRE_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART3_UDRE_vect, OSEE_AVR8_USART3_UDRE_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART3_UDRE_vect)
#endif /* OSEE_AVR8_USART3_UDRE_ISR */

/* USART3_TX interrupt vector */
#if (defined(OSEE_AVR8_USART3_TX_ISR_TID)) && (OSEE_AVR8_USART3_TX_ISR_CAT == 2)
OSEE_AVR8_ISR2_DEFINITION(USART3_TX_vect, OSEE_AVR8_USART3_TX_ISR_TID)
#elif (defined(OSEE_AVR8_USART3_TX_ISR)) && (OSEE_AVR8_USART3_TX_ISR_CAT == 1)
OSEE_AVR8_ISR1_DEFINITION(USART3_TX_vect, OSEE_AVR8_USART3_TX_ISR)
#elif (defined(OSEE_MCU_EXTENDED_STATUS))
OSEE_AVR8_ISR_NOT_DEFINED(USART3_TX_vect)
#endif /* OSEE_AVR8_USART3_TX_ISR */
#endif /* __AVR_ATmega1281__ */

#endif /* OSEE_API_DYNAMIC */
